In [1]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2 
import requests

In [2]:
world_oil_data ="iea-oil-market-report-2001-2016.csv"
worldoil_alldata = pd.read_csv(world_oil_data)
worldoil_alldata.head()

,DATE,FREQUENCY,REGION_NAME,INDICATOR_NAME,VALUE,INDICATOR_ID,REGION_ID,REGION_NOTES,REGION_REGIONID
0,2017-06,Monthly,Japan,Total products,85.7,KN.B47,JP,NaN,JP
1,2018-07,Monthly,Japan,Total products,80.1,KN.B47,JP,NaN,JP
2,2018-08,Monthly,Japan,Total products,87.0,KN.B47,JP,NaN,JP
3,2019-02,Monthly,Japan,Total products,82.4,KN.B47,JP,NaN,JP
4,2019-07,Monthly,Japan,Total products,85.3,KN.B47,JP,NaN,JP

In [3]:
worldoil_alldata.count()

DATE               24969
FREQUENCY          24969
REGION_NAME        24969
INDICATOR_NAME     24969
VALUE              24969
INDICATOR_ID       24969
REGION_ID          24969
REGION_NOTES          31
REGION_REGIONID    24969
dtype: int64

In [4]:
worldoil_alldata.dtypes

DATE                object
FREQUENCY           object
REGION_NAME         object
INDICATOR_NAME      object
VALUE              float64
INDICATOR_ID        object
REGION_ID           object
REGION_NOTES        object
REGION_REGIONID     object
dtype: object

In [5]:
# worldoil_alldata[['Year'], ['Month']] = worldoil_alldata['DATE'].str.split('-',1,expand = True)
# worldoil_alldata[['Year'], ['Month']] = world_oil_data.DATE.apply(lambda x: world_oil_data.Series(str(x).split("-")))
worldoil_alldata['year']= worldoil_alldata.DATE.str.split('-').str[0].tolist()
worldoil_alldata['month']= worldoil_alldata.DATE.str.split('-').str[1].tolist()

worldoil_alldata

,DATE,FREQUENCY,REGION_NAME,INDICATOR_NAME,VALUE,INDICATOR_ID,REGION_ID,REGION_NOTES,REGION_REGIONID,year,month
0,2017-06,Monthly,Japan,Total products,85.70,KN.B47,JP,NaN,JP,2017,06
1,2018-07,Monthly,Japan,Total products,80.10,KN.B47,JP,NaN,JP,2018,07
2,2018-08,Monthly,Japan,Total products,87.00,KN.B47,JP,NaN,JP,2018,08
3,2019-02,Monthly,Japan,Total products,82.40,KN.B47,JP,NaN,JP,2019,02
4,2019-07,Monthly,Japan,Total products,85.30,KN.B47,JP,NaN,JP,2019,07
...,...,...,...,...,...,...,...,...,...,...,...
24964,2003-07,Quarterly,Euro,Demand (mb/d),8.40,KN.B21,KN.DE1,NaN,KN.DE1,2003,07
24965,2004-04,Quarterly,Euro,Demand (mb/d),8.10,KN.B21,KN.DE1,NaN,KN.DE1,2004,04
24966,2005-07,Quarterly,Euro,Demand (mb/d),8.26,KN.B21,KN.DE1,NaN,KN.DE1,2005,07
24967,2006-04,Quarterly,Euro,Demand (mb/d),7.94,KN.B21,KN.DE1,NaN,KN.DE1,2006,04
24968,2007-04,Quarterly,Euro,Demand (mb/d),7.65,KN.B21,KN.DE1,NaN,KN.DE1,2007,04

In [6]:
df = worldoil_alldata['REGION_NOTES'].value_counts()
df = pd. DataFrame(df)
df

                                                    REGION_NOTES
"Total" consist of following areas:  1. US50  2...            31

In [7]:
del worldoil_alldata['REGION_NOTES']
del worldoil_alldata['REGION_REGIONID']
del worldoil_alldata['REGION_ID']
del worldoil_alldata['INDICATOR_ID']
del worldoil_alldata['DATE']
worldoil_alldata

       FREQUENCY REGION_NAME  INDICATOR_NAME  VALUE  year month
0        Monthly       Japan  Total products  85.70  2017    06
1        Monthly       Japan  Total products  80.10  2018    07
2        Monthly       Japan  Total products  87.00  2018    08
3        Monthly       Japan  Total products  82.40  2019    02
4        Monthly       Japan  Total products  85.30  2019    07
...          ...         ...             ...    ...   ...   ...
24964  Quarterly        Euro   Demand (mb/d)   8.40  2003    07
24965  Quarterly        Euro   Demand (mb/d)   8.10  2004    04
24966  Quarterly        Euro   Demand (mb/d)   8.26  2005    07
24967  Quarterly        Euro   Demand (mb/d)   7.94  2006    04
24968  Quarterly        Euro   Demand (mb/d)   7.65  2007    04

[24969 rows x 6 columns]

In [ ]:
df1 = worldoil_alldata ['FREQUENCY'].value_counts()
df1 = pd.DataFrame(df1)
df1

In [ ]:
df2 = worldoil_alldata ['REGION_NAME'].value_counts()
df2 = pd.DataFrame(df2)
df2

In [ ]:
df2.to_csv("worldoildata_allcountries.csv", index= True, header = True)

### When comapred with country list used for Global emissions, the world oil database has 25 less countries but has grouped countires in regional areas like americas, latin americas etc..

In [ ]:
df3 = worldoil_alldata ['INDICATOR_NAME'].value_counts()
df3 = pd.DataFrame(df3)
df3

In [ ]:
df4 = worldoil_alldata.loc[(worldoil_alldata["INDICATOR_NAME"] == "Percentage of Summary Of Global Oil Demand")
                           & (worldoil_alldata["FREQUENCY"] == "Quarterly"), :]
df4 = pd.DataFrame(df4)
# df4 = df4.sort_values["DATE"]
df4